LonelyWolf/stm32/bike-computer/-main.c
			GPS_SendCommand(PMTK_TEST); // Send dummy command to GPS module to wake it up (actually one byte is enough)
			nRF24_SetRXMode(); // Wake the receiver and configure it for RX mode
 			RTC_SetWakeUp(1); // Wake every second

			GUI_refresh = TRUE;
		}

		if (_new_packet) {
			// New packet received and parsed
			_new_packet = FALSE;
			_RF_icon = !_RF_icon; // Blink RF icon
		}

		if (GPS_new_data) {
			// GPS data parsed
			if (GPSData.datetime_valid) {
				// Date and time obtained from GPS
				// TODO: don't do this every time, better involve some duty cycle
				_time.RTC_Hours   =  GPSData.time / 3600;
				_time.RTC_Minutes = (GPSData.time / 60) % 60;
				_time.RTC_Seconds =  GPSData.time % 60;
				i = GPSData.date / 1000000;
				_date.RTC_Date  = i;
				_date.RTC_Month = (GPSData.date - (i * 1000000)) / 10000;
				_date.RTC_Year  = (GPSData.date % 10000) - 2000;
				RTC_AdjustTimeZone(&_time,&_date,Settings.GMT_offset);
				__disable_irq(); // TODO: this should be atomic procedure (it's better disable WKUP IRQ for that time)
				RTC_SetDateTime(&_time,&_date);
				__enable_irq();
				_new_time = TRUE;
			}
			GPS_new_data = FALSE;
		}

		if (_new_time) {
			// Time updated (every second)
			_new_time = FALSE;
		}

		if (GUI_refresh) {
			// GUI must be redrawn
			UC1701_Fill(0x00);

			// Current speed with pace arrows
			GUI_DrawSpeed(scr_width - 55,0,CurData.Speed,CurData.AvgSpeed);

			// Fancy lines
			HLine(0,scr_width - 1,scr_height - 29,PSet);
			VLine(67,0,scr_height - 1,PSet);

			// RF icon
			if (_no_signal_time > NO_SIGNAL_TIME)
				GUI_DrawBitmap(0,0,13,7,&bmp_icon_13x7[65]);
			else if (_RF_icon) {
				GUI_DrawBitmap(0,0,13,7,&bmp_icon_13x7[39]);
			} else {
				GUI_DrawBitmap(0,0,13,7,&bmp_icon_13x7[52]);
			}

			// GPS icon
			if (GPSData.fix != 2 && GPSData.fix != 3)
				GUI_DrawBitmap(16,0,13,7,&bmp_icon_13x7[26]);
			else if (GPSData.fix == 2) GUI_DrawBitmap(16,0,13,7,&bmp_icon_13x7[0]);
			else GUI_DrawBitmap(16,0,13,7,&bmp_icon_13x7[13]);

			// Hardcoded "cadence" value
			PutStr(scr_width - 30,scr_height - 27,"CDC",fnt5x7);
			if (_no_signal_time > NO_SIGNAL_TIME) {
				for (i = 0; i < 3; i++)	FillRect(scr_width - (i * 10) - 15,scr_height - 3,scr_width - (i * 10) - 7,scr_height - 1,PSet);
			} else {
				GUI_DrawNumber(-scr_width + 7,-scr_height + 1,CurData.Cadence,0,DS_Small);
			}
			GUI_DrawBitmap(scr_width - 5,scr_height - 19,5,19,&small_signs[15]);

			// Hardcoded "ride time"
			PutStr(3,scr_height - 27,"Ride Time",fnt5x7);
			GUI_DrawRideTime(0,scr_height - 19,CurData.TripTime);

			if (_bmp180_present) {
				// Current pressure
				GUI_PutPressure(0,26,CurData.Pressure,PT_mmHg,fnt5x7);

				// Current temperature
				GUI_PutTemperature(0,18,CurData.Temperature,fnt5x7);
			}

			// Current time
			GUI_PutTimeSec(0,10,RTC_Time.RTC_Hours * 3600 + RTC_Time.RTC_Minutes * 60 + RTC_Time.RTC_Seconds,fnt5x7);

			ccc++; // <--- Iterations counter, for debug purposes
/*
			i = PutInt(3,3,ccc,fnt5x7);
			Rect(0,0,i + 4,12,PReset);
			Rect(1,1,i + 3,11,PSet);
			Rect(2,2,i + 2,10,PReset);
*/

			UC1701_Flush();
			GUI_refresh = FALSE;
		}

		// "Up" button pressed - just clear the counter, there is no function yet
		if (BTN[BTN_UP].cntr > 0) {
			BTN[BTN_UP].cntr = 0;
		}

		// "Down" button pressed - just clear the counter, there is no function yet
		if (BTN[BTN_DOWN].cntr > 0) {
			BTN[BTN_DOWN].cntr = 0;
		}

		// "Enter" button hold - show main menu
//		if (BTN[BTN_ENTER].state == BTN_Hold) {
		if (BTN[BTN_ENTER].state == BTN_Hold || BTN[BTN_ENTER].cntr) { // <--- TODO: Short press is temporary here
			GUI_MainMenu();
		}

		// "Escape" button pressed - just clear the counter, there is no function for yet
		if (BTN[BTN_ESCAPE].cntr) {
			BTN[BTN_ESCAPE].cntr = 0;
		}

		SleepWait(); // Sleep mode
	}

	// Something awful will happen when you reach this point
}
